; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-3nodes-1000size-5degree-100mindistance-2trucks-8packages-1274seed

(define (problem transport-two-cities-sequential-3nodes-1000size-5degree-100mindistance-2trucks-8packages-1274seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  package-7 - package
  package-8 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 331,472 -> 120,743
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 35)
  ; 120,743 -> 331,472
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 35)
  ; 659,136 -> 120,743
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 82)
  ; 120,743 -> 659,136
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 82)
  ; 659,136 -> 331,472
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 47)
  ; 331,472 -> 659,136
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 47)
  ; 2007,952 -> 2593,864
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 60)
  ; 2593,864 -> 2007,952
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 60)
  ; 2814,308 -> 2593,864
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 60)
  ; 2593,864 -> 2814,308
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 60)
  ; 659,136 <-> 2007,952
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 158)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 158)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-3)
  (at package-4 city-1-loc-3)
  (at package-5 city-1-loc-3)
  (at package-6 city-1-loc-2)
  (at package-7 city-1-loc-3)
  (at package-8 city-1-loc-3)
  (at truck-1 city-2-loc-2)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-3)
  (at package-2 city-2-loc-1)
  (at package-3 city-2-loc-3)
  (at package-4 city-2-loc-2)
  (at package-5 city-2-loc-3)
  (at package-6 city-2-loc-2)
  (at package-7 city-2-loc-3)
  (at package-8 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 8
2. (drive truck-2 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 8
3. (pick-up truck-2 city-1-loc-3 package-8 capacity-2 capacity-3)
   deleted: (at package-8 city-1-loc-3) (capacity truck-2 capacity-3)
   added: (in package-8 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 8
4. (pick-up truck-2 city-1-loc-3 package-7 capacity-1 capacity-2)
   deleted: (at package-7 city-1-loc-3) (capacity truck-2 capacity-2)
   added: (in package-7 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 8
5. (pick-up truck-2 city-1-loc-3 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-1-loc-3) (capacity truck-2 capacity-1)
   added: (in package-5 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 8
6. (drive truck-1 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 8
7. (pick-up truck-1 city-1-loc-3 package-4 capacity-2 capacity-3)
   deleted: (at package-4 city-1-loc-3) (capacity truck-1 capacity-3)
   added: (in package-4 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 8
8. (pick-up truck-1 city-1-loc-3 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-3) (capacity truck-1 capacity-2)
   added: (in package-3 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 8
9. (drive truck-1 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 8
10. (pick-up truck-1 city-1-loc-2 package-6 capacity-0 capacity-1)
   deleted: (at package-6 city-1-loc-2) (capacity truck-1 capacity-1)
   added: (in package-6 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 8
11. (drive truck-1 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 8
12. (drive truck-1 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 8
13. (drop truck-1 city-2-loc-2 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-1) (capacity truck-1 capacity-0)
   added: (at package-6 city-2-loc-2) (capacity truck-1 capacity-1)
   goals met: 1 of 8
14. (drop truck-1 city-2-loc-2 package-4 capacity-1 capacity-2)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-1)
   added: (at package-4 city-2-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 8
15. (drive truck-1 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 8
16. (drive truck-1 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 2 of 8
17. (pick-up truck-1 city-1-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-1) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 2 of 8
18. (pick-up truck-1 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 8
19. (drive truck-2 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-2-loc-2)
   goals met: 2 of 8
20. (drive truck-1 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-3)
   goals met: 2 of 8
21. (drive truck-1 city-1-loc-3 city-2-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-2-loc-2)
   goals met: 2 of 8
22. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 2 of 8
23. (drive truck-2 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-1)
   goals met: 2 of 8
24. (drop truck-1 city-2-loc-1 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-2-loc-1) (capacity truck-1 capacity-1)
   goals met: 3 of 8
25. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 3 of 8
26. (drop truck-1 city-2-loc-3 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-1)
   added: (at package-1 city-2-loc-3) (capacity truck-1 capacity-2)
   goals met: 4 of 8
27. (drop truck-1 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 5 of 8
28. (drop truck-2 city-2-loc-1 package-8 capacity-0 capacity-1)
   deleted: (in package-8 truck-2) (capacity truck-2 capacity-0)
   added: (at package-8 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 6 of 8
29. (drive truck-2 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-3)
   goals met: 6 of 8
30. (drop truck-2 city-2-loc-3 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-1)
   added: (at package-5 city-2-loc-3) (capacity truck-2 capacity-2)
   goals met: 7 of 8
31. (drop truck-2 city-2-loc-3 package-7 capacity-2 capacity-3)
   deleted: (in package-7 truck-2) (capacity truck-2 capacity-2)
   added: (at package-7 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 8 of 8
